src/bsl/InformationRegisters/гкс_НахождениеВагоновНаПутяхСРПВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_НахождениеВагоновНаПутяхСРПВ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>WaggonDispatchId</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_WagonDispatchID</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WaggonIndexPark</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Вагон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_СтруктураПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СоответствияОбъектовСРПВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СоответствияОбъектовСРПВ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_ИнтеграцияСРПВСправочники</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипОбъектаСРПВ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыОбъектовСРПВ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСРПВ</Name>
					<Comment>Идентификатор объекта СРПВ</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_ИдентификаторыСРПВ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/Enums/гкс_ТипыТранспортныхСредствДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипыТранспортныхСредствДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Судно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖДТранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Самолёт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Трубопровод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контейнер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_ТипыОбъектовСРПВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипыОбъектовСРПВ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПЛК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Весы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтруктураПЛК</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Catalogs/ТранспортныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТранспортныеСредства</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерТранспортногоСредства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеПоискаГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОсей</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_КоличествоОсейТранспортногоСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Марка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСправочникПЛК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_НахождениеВагоновНаПутяхСРПВ/Ext/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записывает в регистр актуальную информацию о положении вагонов на путях.
//
// Параметры:
//  ДанныеОПоложенииВагонов - Массив - коллекция с данными о положении вагонов в виде структур.
Процедура АктуализироватьИнформациюОПоложенииВагоновНаПутях(ДанныеОПоложенииВагонов) Экспорт

	ТаблицаДляЗагрузки = ПодготовитьТаблицуДляЗагрузки(ДанныеОПоложенииВагонов);
	Если Не ТаблицаДляЗагрузки = Неопределено Тогда
		ЗаписатьАктуальныеДанные(ТаблицаДляЗагрузки);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПодготовитьТаблицуДляЗагрузки(ДанныеОПоложенииВагонов)

	ТаблицаДляОбработки = ИнициализироватьТаблицаДляЗагрузки();
	МассивВТаблицуЗначений(ДанныеОПоложенииВагонов, ТаблицаДляОбработки);

	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапросаСопоставленияОбъектов();
	Запрос.УстановитьПараметр("ДанныеДляЗагрузки"	, ТаблицаДляОбработки);
	Запрос.УстановитьПараметр("ДатаСостояния"		, ТекущаяДатаСеанса());
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ДанныеДляЗагрузки = Неопределено;
	Иначе

		НачатьТранзакцию();
		Попытка

			ДанныеДляЗагрузки = РезультатЗапроса.Выгрузить();
			Для Каждого СтрокаЗагрузки Из ДанныеДляЗагрузки Цикл

				// Дозаполнить ссылочные свойства коллекции.
				Если Не ЗначениеЗаполнено(СтрокаЗагрузки.Путь) Тогда
					СтрокаЗагрузки.Путь = НовыйПЛК(СтрокаЗагрузки);
				КонецЕсли;

				Если Не ЗначениеЗаполнено(СтрокаЗагрузки.Вагон) Тогда
					СтрокаЗагрузки.Вагон = НовыйВагон(СтрокаЗагрузки);
				КонецЕсли;

			КонецЦикла;

			ЗафиксироватьТранзакцию();

		Исключение

			ОтменитьТранзакцию();
			ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(
				"Интеграция СРПВ. Нахождение вагонов на путях",
				УровеньЖурналаРегистрации.Ошибка,,,
				ПредставлениеОшибки);

			ДанныеДляЗагрузки = Неопределено;

		КонецПопытки;

	КонецЕсли;

	Возврат ДанныеДляЗагрузки;

КонецФункции

Процедура ЗаписатьАктуальныеДанные(ТаблицаДляЗагрузки)

	Попытка

		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Загрузить(ТаблицаДляЗагрузки);
		НаборЗаписей.Записать(РежимЗамещения.Замещение);

	Исключение

		ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			"Интеграция СРПВ. Нахождение вагонов на путях",
			УровеньЖурналаРегистрации.Ошибка,,,
			ПредставлениеОшибки);

	КонецПопытки;

КонецПроцедуры

Функция ТекстЗапросаСопоставленияОбъектов()
	Возврат
	"ВЫБРАТЬ
	|	ДЗ.WaggonNumber КАК WaggonNumber,
	|	ДЗ.WaggonDispatchId КАК WaggonDispatchId,
	|	ДЗ.WaggonIndexPark КАК WaggonIndexPark,
	|	ДЗ.RailWayTrackIdPark КАК RailWayTrackIdPark,
	|	ДЗ.RailWayTrackName КАК RailWayTrackName
	|ПОМЕСТИТЬ ДанныеПоВагонам
	|ИЗ
	|	&ДанныеДляЗагрузки КАК ДЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоВагонам.WaggonNumber КАК WaggonNumber,
	|	ДанныеПоВагонам.WaggonDispatchId КАК WaggonDispatchId,
	|	ДанныеПоВагонам.WaggonIndexPark КАК WaggonIndexPark,
	|	МАКСИМУМ(ЕСТЬNULL(ТранспортныеСредства.Ссылка, ЗНАЧЕНИЕ(Справочник.ТранспортныеСредства.ПустаяСсылка))) КАК Вагон,
	|	ДанныеПоВагонам.RailWayTrackIdPark КАК RailWayTrackIdPark,
	|	ДанныеПоВагонам.RailWayTrackName КАК RailWayTrackName,
	|	ЕСТЬNULL(гкс_СоответствияОбъектовСРПВ.Ссылка, ЗНАЧЕНИЕ(Справочник.гкс_СтруктураПЛК.ПустаяСсылка)) КАК Путь,
	|	МАКСИМУМ(&ДатаСостояния) КАК ДатаСостояния
	|ИЗ
	|	ДанныеПоВагонам КАК ДанныеПоВагонам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТранспортныеСредства КАК ТранспортныеСредства
	|		ПО ТранспортныеСредства.НомерТранспортногоСредства = ДанныеПоВагонам.WaggonNumber
	|		И ТранспортныеСредства.ВидПеревозки = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт)
	|		И НЕ ТранспортныеСредства.ПометкаУдаления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СоответствияОбъектовСРПВ КАК гкс_СоответствияОбъектовСРПВ
	|		ПО ДанныеПоВагонам.RailWayTrackIdPark = гкс_СоответствияОбъектовСРПВ.ИдентификаторСРПВ
	|		И гкс_СоответствияОбъектовСРПВ.ТипОбъектаСРПВ = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыОбъектовСРПВ.СтруктураПЛК)
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПоВагонам.WaggonNumber,
	|	ДанныеПоВагонам.WaggonDispatchId,
	|	ДанныеПоВагонам.WaggonIndexPark,
	|	ДанныеПоВагонам.RailWayTrackIdPark,
	|	ДанныеПоВагонам.RailWayTrackName,
	|	ЕСТЬNULL(гкс_СоответствияОбъектовСРПВ.Ссылка, ЗНАЧЕНИЕ(Справочник.гкс_СтруктураПЛК.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДанныеПоВагонам";
КонецФункции

Функция НовыйПЛК(СтрокаДанных)

	ЖДПуть = Справочники.гкс_СтруктураПЛК.СоздатьЭлемент();
	ЖДПуть.Наименование = СтрокаДанных.RailWayTrackName;
	ЖДПуть.ТипТранспортныхСредств = Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт;
	ЖДПуть.ОбменДанными.Загрузка = Истина;
	ЖДПуть.Записать();

	ДобавитьСоответствиеОбъекта(СтрокаДанных, ЖДПуть.Ссылка);

	Возврат ЖДПуть.Ссылка;

КонецФункции

Функция НовыйВагон(СтрокаДанных)

	ЖдВагон = Справочники.ТранспортныеСредства.СоздатьЭлемент();
	ЖдВагон.НомерТранспортногоСредства = СтрокаДанных.WaggonNumber;
	ЖдВагон.Наименование = СтрокаДанных.WaggonNumber;
	ЖдВагон.ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт;
	ЖдВагон.ОбменДанными.Загрузка = Истина;
	ЖдВагон.Записать();

	Возврат ЖдВагон.Ссылка;

КонецФункции

Процедура ДобавитьСоответствиеОбъекта(СтрокаДанных, Ссылка)

	МенеджерЗаписи = РегистрыСведений.гкс_СоответствияОбъектовСРПВ.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторСРПВ = СтрокаДанных.RailWayTrackIdPark;
	МенеджерЗаписи.ТипОбъектаСРПВ = Перечисления.гкс_ТипыОбъектовСРПВ.СтруктураПЛК;
	МенеджерЗаписи.Ссылка = Ссылка;
	МенеджерЗаписи.Записать();

КонецПроцедуры

Процедура МассивВТаблицуЗначений(Массив, Таблица) Экспорт

	Для Каждого ЭлементМассива Из Массив Цикл
		ЗаполнитьЗначенияСвойств(Таблица.Добавить(), ЭлементМассива);
	КонецЦикла;

КонецПроцедуры

Функция ИнициализироватьТаблицаДляЗагрузки()

	ДлинаСтроки8 = 8;
	ДлинаСтроки10 = 10;
	ДлинаСтроки20 = 20;
	ДлинаСтроки25 = 25;

	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("WaggonNumber", ОбщегоНазначения.ОписаниеТипаСтрока(ДлинаСтроки8));
	Таблица.Колонки.Добавить("WaggonDispatchId", ОбщегоНазначения.ОписаниеТипаЧисло(ДлинаСтроки20));
	Таблица.Колонки.Добавить("WaggonIndexPark", ОбщегоНазначения.ОписаниеТипаЧисло(ДлинаСтроки10));
	Таблица.Колонки.Добавить("RailWayTrackIdPark", ОбщегоНазначения.ОписаниеТипаЧисло(ДлинаСтроки20));
	Таблица.Колонки.Добавить("RailWayTrackName", ОбщегоНазначения.ОписаниеТипаСтрока(ДлинаСтроки25));
	Таблица.Колонки.Добавить("PlcId", ОбщегоНазначения.ОписаниеТипаСтрока(ДлинаСтроки20));

	Возврат Таблица;

КонецФункции

#КонецОбласти

#КонецЕсли
